Revit 2017 API
RebarShape.SetEndTreatmentTypeId Method
 set the end treatment type id for the designated shape end
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2017
Syntax
C#
public void SetEndTreatmentTypeId(
	ElementId treatmenetId,
	int iEnd
)
Visual Basic
Public Sub SetEndTreatmentTypeId ( _
	treatmenetId As ElementId, _
	iEnd As Integer _
)
Visual C++
public:
void SetEndTreatmentTypeId(
	ElementId^ treatmenetId,
	int iEnd
)
Parameters
treatmenetId
Type: Autodesk.Revit.DB.ElementId
iEnd
Type: System.Int32
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  iEnd not a valid shape end
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace